[
    {
        "que": "What is the procedure for placing an order?",
        "ans":"The usual procedure for placing an order would include customers intimating us with requests for auto parts online or directly contacting us wherein our Senior Auto Parts Specialists, matches all the specifications of the Auto Part with our catalogues, either with your VIN or by asking some industry standard relevant questions to narrow down the part. Then the order is again verified by a “Verifier”, following which we accept payment, sends the invoice to the customer and ships the part out."
    },
    {
        "que": "If I get a defective or a wrong part, how do I return it?",
        "ans":"If you find out that you received a wrong part or a defective one, the first thing you should do is to call us and if we are not available (out of business hours), send us an Email. Once you intimate us, our Authorized Personnel will reach you and provide you the guidelines to return the part back and send you the RMA (Return Merchandise Authorization) form."
    },
    {
        "que": "How long does it take for the shipment?",
        "ans":"Once we get the order from you, your auto part is once again quality checked and inspected and shipped usually in 24 – 48 hours. For the non-freight auto parts we sell, the average time frame we show on paper is 5 -7 business days for a free regular shipping, but you might get it sooner as well. For the freight auto parts we sell, the average time frame is 7 – 10 business days. We also have expedite options – delivery in 3 business days, 2 business days and 1 business day"
    },
    {
        "que": "How do I track my shipment?",
        "ans":"We will send you the Shipment Tracking Number to your Email provided at the time of placing the order. In case you do not have an Email, we will call you to provide the Tracking number."
    },
    {
        "que": "How can I check my Order Status?",
        "ans":"We would be sending you all major updates regarding your order to your Email at the time of placing the order. Additionally, we provide you with a unique Order Number and Reference Number which you can provide to our Customer Service Representative to pull up your Order Details."
    },
    {
        "que": "Is it too late to change or cancel my order?",
        "ans":"Since most orders begin processing immediately, there is a short window in canceling or changing an order. We will make every effort to accommodate changes to or cancellations of orders that have not yet processed; However, we are unable to change or cancel an order once it begins processing. If less than an hour has passed since submitting your order, you may either :</br>Call Customer Service @ <a href='tel:1-800.608.3868'><u>1-800.608.3868</u></a>, opt 2 or Email us at : <a href='mailto:customerservcie@backtoroadautoparts.com'><u>customerservcie@backtoroadautoparts.com</u></a>"
    }
]

