[
    {
        "que": "What can I expect when buying used parts from BackToRoad Auto Parts?",
        "ans":"At BackToRoad Auto Parts, we sell used OEM parts, which are inspected and verified to be of good quality. We sell recycled or used parts, also known as ‘green parts” which are officially manufactured by the automobile brand and are known as Original Equipment Manufacturer (OEM) parts. This means that the replacement parts we provide are produced by the manufacturer of your vehicle, so you can rest assured that the used parts will be compatible with your vehicle and will improve the efficiency of your vehicle."
    },
    {
        "que": "Why should I opt for green parts as compared to brand-new auto parts?",
        "ans":"The major benefits of buying green parts or used parts are that they are economical, eco-friendly and also, you’ll get high-quality OEM parts that are ready to be installed in your vehicle. In fact, it is not viable to always opt for brand-new parts since you simply cannot afford to pay a huge amount of money for new OEM parts. Also, a lot of parts for older vehicles, are out of stock at the manufacturer and what is available as “new” are aftermarket replacements. The better option here is green parts as they can be up to 50% cheaper than brand-new OEM parts. In fact, choosing recycled parts doesn’t leave you with a narrow choice, instead, there is an abundance of parts available including used parts for brands such as Ford, Ferrari, and just about every other manufacturer in between."
    },
    {
        "que": "Does BackToRoad Auto Parts make sure of the quality of used parts before shipment?",
        "ans":"The Motor Vehicle Dismantlers Association (MVDA) has issued news that it will adopt and promote the ARA Parts Standards and BSI’s PAS777. The Automotive Recyclers Association of America (ARA) Parts Standard has helped green parts usage to become more widespread in the insurance repair industry in the US. Here at BackToRoad Auto Parts, we follow the ARA Parts Standard and grading for all the used parts we sell. So, if you purchase a green part, you can be certain it will undergo quality tests to ensure that the part is fit for user needs. We also provide you with a standard warranty to further enhance your peace of mind. Hence, you can trust that a green part you buy from us will give you as much output as a new part, at a lesser price."
    },
    {
        "que": "What is the procedure for placing an order?",
        "ans":"To place an order, you should first let us know your request for auto parts online through our website or you can directly call us wherein our Senior Auto Parts Specialists will match all the specifications of the auto part you need with our catalog. To do this we will either need some industry-standard relevant information about your vehicle and the auto part you need or the VIN of your vehicle. Then once the auto part is fixed upon, the order is again verified by a “verifier”, following which we accept payment. Once the payment is done, we will send you the invoice of the order and dispatch it to the given address."
    },
    {
        "que": "Will I get a warranty on my used part purchase?",
        "ans":"BackToRoad Auto Parts provides a standard 30-day warranty on all our products starting from the day of purchase. In case of any damage to the used part, you can inform us immediately and we will provide you with a refund or a replacement as desired. We aim to provide a smooth and satisfactory experience for all of our customers."
    },{
        "que": "If I get a defective or a wrong part, how do I return it?",
        "ans":"If you receive a wrong or defective product, the first thing you should do is to let us know by calling us or sending us an email. Once you let us know, our authorized personnel will contact you regarding the necessary steps you have to take to return the part and send you the RMA (Return Merchandise Authorization) form."
    },
    {
        "que": "How long does the shipping process take?",
        "ans":"Once we get an order, the auto part is again quality checked and inspected, and then shipped in the next 24-48 hours. For non-freight auto parts, the average time frame is 5-7 business days for free regular shipping, but you might get it in lesser time as well. For freight auto parts, the average time frame is 7-10 business days. We also have expedited options that provide delivery in 3 business days, 2 business days, or 1 business day as per your request."
    },
    {
        "que": "How do I track my shipment?",
        "ans":"Once we dispatch your shipment, we will send the shipment tracking number to your email address provided at the time of placing the order. In case you do not have an email address, we will call you to provide the tracking number using which you can track the whereabouts of your shipment."
    },
    {
        "que": "Why was I told that BackToRoad Auto Parts does not promote shipping to a residential address other than my billing address?",
        "ans":"At BackToRoad Auto Parts, we take extreme measures to prevent fraud. So, for debit card/credit card payments, our general principle is to ship to the customer’s billing address, which usually is the customer’s primary residential address. However, if the customer needs the part to be shipped to a registered business address, we are more than happy to do so."
    },
    {
        "que": "Do I have the option of picking up my part?",
        "ans":"Unfortunately, we do not currently provide you with the option of picking up your order. We are a professional warehouse (which is different from a store) and we provide fast and free shipping to our customers in the United States and Canada. We prefer that our customers sit in the comfort of their homes and we deliver our products to your residence or your mechanic’s auto shop as required."
    }
]

